<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Signs a provided installer package using a signing certificate identifier.</string>
    <key>Identifier</key>
    <string>tech.sjohnson.autopkg.sign.APCJ</string>
    <key>Input</key>
    <dict>
  	<key>SIGNINGCERTIFICATE</key>
		<string>Replace_Me_In_The_Override</string>
    </dict>
    <key>ParentRecipe</key>
    <string>tech.sjohnson.autopkg.pkg.APCJ</string>
    <key>Process</key>
    <array>
        <dict>
			<key>Processor</key>
			<string>com.github.rtrouton.SharedProcessors/PkgSigner</string>
			<key>Arguments</key>
			<dict>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%OUTPUTNAME%-%version%.pkg</string>
                <key>signing_cert</key>
                <string>%SIGNINGCERTIFICATE%</string>
			</dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>PathDeleter</string>
			<key>Arguments</key>
			<dict>
                <key>path_list</key>
                <string>%RECIPE_CACHE_DIR%/%OUTPUTNAME%-%version%-unsigned.pkg</string>
			</dict>
        </dict>
    </array>
</dict>
</plist>
